// เปลี่ยน index.html ทำเป็น Memorandum Web App ส่งแจ้งเตือนผ่าน line
// 1. การจัดการและสร้างเอกสาร (Document Management)
// * ระบบเทมเพลตมาตรฐาน: มีฟอร์มบันทึกข้อความที่ระบุหัวข้อสำคัญครบถ้วน เช่น วันที่, แผนก, เรื่อง, เรียน (ผู้รับ), และเนื้อหา
// * การแนบไฟล์ (Attachment): รองรับการแนบเอกสารประกอบ เช่น PDF, รูปภาพ หรือไฟล์อ้างอิงอื่นๆ เพื่อให้ผู้อนุมัติมีข้อมูลครบถ้วน cloudinary สร้าง folder ชื่อ MEMO
// * การจัดหมวดหมู่และค้นหา (Indexing & Search): ระบบควรมีฟังก์ชัน Tag หรือระบุประเภทเอกสาร เพื่อให้ค้นหาเอกสารย้อนหลังได้รวดเร็วแบบ Real-time 

// 2. ระบบอนุมัติและเส้นทางเอกสาร (Workflow & Approval)
// * การกำหนดลำดับการอนุมัติ (Workflow): สามารถระบุเส้นทางการส่งเรื่องจากผู้สร้างไปยังผู้ตรวจสอบและผู้อนุมัติในแต่ละระดับได้
// * การติดตามสถานะ (Status Tracking): เจ้าของเรื่องสามารถดูได้ทันทีว่าเอกสารอยู่ที่ใคร หรือได้รับการอนุมัติแล้วหรือยัง [

// 3. การแจ้งเตือนและการเข้าถึง (Notification & Accessibility)
// * ระบบแจ้งเตือน (Notifications): แจ้งเตือนผ่านLine เมื่อมีเอกสารใหม่รออนุมัติหรือสถานะเปลี่ยนไป
// * รองรับทุกอุปกรณ์ (Responsive Design): ใช้งานได้ทั้งบนคอมพิวเตอร์ แท็บเล็ต และสมาร์ทโฟน เพื่อให้อนุมัติงานได้ทุกที่ทุกเวลา 

// 4. ความปลอดภัยและประวัติ (Security & Audit Trail)
// * การควบคุมสิทธิ์ (Role-based Access): กำหนดได้ว่าใครมีสิทธิ์อ่าน แก้ไข หรืออนุมัติเอกสารในส่วนไหน
// * ประวัติการใช้งาน (Audit Log): บันทึกทุกกิจกรรมที่เกิดขึ้นกับเอกสาร ใครเปิดดู ใครแก้ไข หรือเซ็นอนุมัติเมื่อไหร่ เพื่อตรวจสอบย้อนหลังได้

//ใช้ฐานข้อมูล firebase realtime
// const firebaseConfig = {
//   apiKey: "AIzaSyD5ZWVYevzL0Qj-H_jiVIL7WyH0vOp1kLs",
//   authDomain: "test2-a3a49.firebaseapp.com",
//   databaseURL: "https://test2-a3a49-default-rtdb.asia-southeast1.firebasedatabase.app",
//   projectId: "test2-a3a49",
//   storageBucket: "test2-a3a49.firebasestorage.app",
//   messagingSenderId: "210722067503",
//   appId: "1:210722067503:web:069f168981aa965392a2da",
//   measurementId: "G-FEDYDSVGZC"
// };
